Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་འདུལ་བའི་དབང་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བདུད་འདུལ་བའི་གསང་བའི་ཁྱད་པར་གྱི་སྒོའི་རང་བཞིན་སྟོན་པ་ལྟ་བུར་བཅོས་པ་ལེགས་པར་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: Through the power by which all the buddhas tame sentient beings, they will see well the expedient, which appears as a natural display, of the special secret gateway of subduing Māra at the base of the Bodhi tree.

source: ཐབས་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་དང་། ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ལྟ་བུར་བཅོས་པའི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་རོ། །
en: They will turn the wheel of Dharma through skillful means and will behold the reality of the expedient wherein, through skillful means, it appears that one passes into parinirvāṇa.

source: སངས་རྒྱས་ཐམས་ཅད་རོལ་པའི་གསང་བའི་རྒྱལ་པོའི་མཆོག་ཏུ་ཡང་འགྱུར་རོ། །
en: They will become supreme kings of the secret display of all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་མཚུངས་པ་མེད་པ། དཔེ་མེད་པ། གྲངས་མེད་པ། དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་ཏེ།
en: They will become kings of enumerating the inconceivable, unparalleled, incomparable, countless, unfathomable, innumerable domains of all the buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཏིང་ངེ་འཛིན་དང་པོ་འདི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་ཞིང་ཏིང་ངེ་འཛིན་ཡང་དག་པར་སོགས་པར་ཡང་འགྱུར་རོ། །སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། དཔེ་མེད་པ། གྲངས་མེད་པ། དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ། །
en: “Great Cloud Essence, all bodhisattva mahāsattvas who possess this first samādhi will become oceans of samādhi and correctly accumulate the samādhis and so forth as described before up to the point where it is said, ‘they will become kings of enumerating the inconceivable, unparalleled, incomparable, countless, unfathomable, innumerable domains of all the buddhas.’

source: སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་སྤྲིན་ཆེན་པོའི་མདོ་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་སྨན་རྟོན་པའི་རླུང་ཟབ་མོའི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Great Cloud Essence, moreover, within the inconceivable domain of this Great Cloud discourse there is the samādhi of all buddhas and bodhisattvas called profound liberation of the wind that serves as medicine.

source: སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། དཔེ་མེད་པ། གྲངས་མེད་པ། དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་ཏེ
en: They will correctly harvest the samādhis and so forth as described before, up to the point where it is said, ‘They will become kings of enumerating the inconceivable, unparalleled, incomparable, countless, unfathomable, innumerable domains of all the buddhas.’

source: སྤྲིན་ཆེན་སྙིང་པོ་ཏིང་ངེ་འཛིན་གཉིས་པོ་འདི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་རོ། །སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། དཔེ་མེད་པ། གྲངས་མེད་པ། དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ། །
en: Great Cloud Essence, all bodhisattva mahāsattvas who possess this second samādhi will become oceans of samādhi and correctly accumulate the samādhis and so forth as described before, up to the point where it is said, ‘They will become kings of enumerating the inconceivable, unparalleled, incomparable, countless, unfathomable, innumerable domains of all the buddhas.’

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་བར་བྱ་སྟེ།
en: All the samādhis, moreover, will produce these same effects, as described before.

source: ཡེ་ཤེས་ཀྱི་གནས་ཟབ་མོའི་སྒོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called profound gateway to the abode of gnosis.

source: སངས་རྒྱས་ཀྱི་སྨན་གཤོང་ན་གནས་པའི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called liberation that abides on the mountain slopes of the buddhas.

source: དཔའ་བའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called heroic strength.

source: དཔའ་བོ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called heroic victory.

source: དཔའ་བའི་རྣམ་པ་ལ་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called vision of heroic form.

source: མེ་ཏོག་གི་དྲི་ལྟར་བསུང་ཞིམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called flower-like fragrant scent.

source: ཞི་བའི་འོད་ཟེར་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing pacifying light rays.

source: མཐའ་ཡས་པར་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called infinite appearances.

source: དོན་གསང་བ་ཟབ་མོ་ཞེས་བྱ་བའི་སྒོའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called gateway to the profound secret meaning.

source: དོན་ལ་དགའ་བ་ཟབ་མོའི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called profound liberation thatdelights in the meaning.

source: དོན་གྱི་སྟོབས་ཀྱི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called liberation of the strength of the meaning.

source: ཤིང་སཱ་ལ་ཅན་འཇོམས་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called subduer of the śāla tree.

source: གང་གཱའི་བྱེ་མའི་སྒོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called gateways as numerous as the grains of sand of the Ganges.

source: མདུད་པ་ཐམས་ཅད་ལས་གྲོལ་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called unraveling all the knots.

source: ཐམས་ཅད་དང་མཚུངས་པར་བརྟན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called stability in harmony.

source: དེ་ཁོ་ན་འཛིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called apprehending reality.

source: རྒྱ་མཚོའི་དུས་ཚོད་ལས་འདས་པའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called far stronger than the oceanic tide.#15

source: རྩ་བའི་སྟོབས་ལས་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called liberation from the fundamental force.

source: བདུད་བྱེ་བ་འཇོམས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called defeating ten million māras.

source: ཚུལ་ཁྲིམས་བརྟན་པར་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called constantly abiding by discipline.

source: རིའི་རྒྱལ་པོ་ལྟར་གནས་པའི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called liberation that abides like the king of mountains.

source: ཚུལ་རབ་ཏུ་བསྔགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called deeply honored conduct.

source: ནམ་མཁའ་ལྡིང་གི་ཤུགས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called power of the garuḍa.

source: ཆུ་ལྟར་འབབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called flowing like water.

source: རྒྱ་མཚོ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of the oceanic magical manifestation.

source: དྲི་མ་མེད་པར་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called abiding without stains.

source: མི་འཇིགས་པའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called fearless strength.

source: སྒྱུ་མ་མཁན་གྱིས་བུད་མེད་སྤྲུལ་པ་ལྟ་བུའི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called liberation that is like a woman conjured by an illusionist.

source: གློག་མཆེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called lightning flare.

source: གློག་འགྱུ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called lightning flash.

source: གཟི་བརྗིད་ཀྱི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called brilliant light.

source: བློ་གྲོས་མི་ཟད་པའི་ཕྲེང་ལྡན་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called garlanded king of inexhaustible intellect.

source: སྤྲིན་ལྟར་བློ་གྲོས་མི་ཟད་པའི་ཆུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called water of the cloud-like, inexhaustible intellect.

source: རྒྱུན་མང་པོའི་འོད་འཕྲོ་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called radiant great flow.

source: ས་བོན་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called seed-like.

source: བློ་གྲོས་རྒྱ་མཚོའི་མཐའ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called the limit of oceanic intellect.

source: མྱོང་བའི་ཡན་ལག་ལ་ཆགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called attached to the various branches of experience.

source: དད་པས་རྣམ་པར་གྲོལ་བ་ལ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called abiding in liberation through faith.

source: རྒྱུ་དང་རྐྱེན་དུ་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing cause and conditions.

source: ལས་དང་འདྲ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called similar to karma.

source: ནམ་མཁའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of space.

source: ཆགས་པ་ལ་མཐུ་ཆེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called great power for attachment.

source: བཻ་དཱུརྱའི་རྩེ་མོའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of the berylpeak.

source: ལྷུན་པོའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called light of Mount Meru.

source: སེང་གེ་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called magical manifestation of the lion.

source: བདུད་རྩི་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called nectar-like.

source: ཉི་མ་འཆར་ཀ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called like the dawning sun.

source: པད་མ་མེ་ལྟར་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called fire-like lotus illumination.

source: ཡུལ་གཙོ་བོར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called exalted throughout the land.

source: ཐམས་ཅད་ཀྱི་ཡན་ལག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called branches of everything.

source: རྒྱ་མཚོ་འཁྲུག་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called ocean-stirring king.

source: སའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called strength of earth.

source: ཐམས་ཅད་ལ་ཚོད་རན་པར་འདོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called desiring everything in moderation.

source: བུད་མེད་ཀྱི་གཙུག་གི་ནོར་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called woman’s crown jewel.

source: བུད་མེད་ཀྱི་འཁོར་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called woman’s retinue.

source: རི་དགས་སྦྲེངས་པའི་འཁོར་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called deer’s retinue.

source: ཕྲ་བར་སྤྱོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called subtle conduct.

source: རྔའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of drums.

source: བློ་གྲོས་འཕགས་སྐྱེས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called gift of noble intellect.

source: ཤུགས་འཛིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called holder of power.

source: འབབ་ཆུའི་རྒྱུན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called waterfall cascade.

source: སྒྲོལ་བའི་བློ་གྲོས་མང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called great liberated intellect.

source: སྒྲས་དགའ་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called bringing joy through sound.

source: སྣང་བའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called illuminating light.

source: མུན་པ་ལས་རྣམ་པར་གྲོལ་བར་བྱེད་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called light that brings complete liberation from darkness.

source: རྒྱ་མཚོའི་སྙིང་པོའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the intellect of the ocean’s essence.

source: མར་མེ་རབ་ཏུ་བསྔགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called lamp of utter praise.

source: ཏི་སེའི་གངས་ལྟ་བུའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the intellect that is like Mount Kailāśa.

source: ད་ལྟར་བྱུང་བའི་སྣང་བའི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called complete liberation of appearances in the present moment.

source: མཉམ་པའི་ཆུའི་གསང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called secret of still water.

source: པད་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called lotus essence.

source: འོད་ཀྱིས་རྒྱས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called replete with light.

source: མེ་ཏོག་ཁ་མ་བྱེ་བ་མཛེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called beauty of a ten million–petaled flower.

source: ཀ་ཤའི་མེ་ཏོག་གི་མདོག་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called colored like the kuśa-grass flower.

source: ཆགས་པ་ལས་རྣམ་པར་གྲོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called completely liberated from attachment.

source: ཡང་དག་པར་རྗོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called correct speech.

source: དམིགས་པ་དང་བཅས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of referential mental activity.

source: དཔེས་རིག་པར་བྱེད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called the king of illustrating through examples.

source: ཕུང་པོ་ཐམས་ཅད་ཀྱི་ཕྲེང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called garland of all the aggregates.

source: ཀླུའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called nāga king.

source: སྟག་ལྟར་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called playing like a tiger.

source: རླུང་གི་སྟོབས་དང་མཚུངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called strong as wind.

source: རླུང་གི་ཤུགས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of wind’s power.

source: ཁ་དོག་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called infinite color.

source: ཆོས་ཀྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the intellect of Dharma.

source: སྤོས་དྲི་ཞིམ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called incense fragrance.

source: མཚན་མའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the intellect with characteristics.

source: ཁ་དོག་གི་བློ་གྲོས་ཀྱི་མདོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called color of the intellect of color.

source: ཉེས་པ་འཇོམས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of overcoming evil.

source: པད་མའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the intellect like a lotus.

source: སྟོབས་ཀྱི་ཕྱོགས་ཀྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the intellect with strong wings.

source: གཏི་མུག་སྒྲོལ་བྱེད་གསོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called healing that liberates ignorance.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་མེ་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called flower of the branches of awakening.

source: སྤྲིན་གྱི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called cloud strength.

source: རིན་པོ་ཆེའི་ཆུས་རྙིས་པར་བྱེད་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the intellect that wears down with precious water.

source: སྤྱིས་བཙན་པའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called fierce strength.

source: ཉི་མའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called sunlight.

source: ཟླ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called stainless moon.

source: རྒྱ་མཚོའི་དུས་ཚོད་མཛེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called beautiful oceanic tide.

source: དམིགས་པའི་དུས་ཚོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called perceiving eye.

source: ཉོན་མོངས་པའི་དྲི་མ་འཇོམས་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called way to overcome stains of afflictions.

source: བསིལ་བའི་ཆར་པའི་དུས་ཚོད་འཛིན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king who sustains the season of cooling rains.

source: ཨ་མྲའི་མེ་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called mango flower.

source: གཞུང་ལུགས་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called completely pure scriptural tradition.

source: ངང་ཚུལ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called excellent conduct.

source: དུང་གི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called conch-shell light.

source: དུས་ཚིགས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of seasons.

source: མདངས་ཤིན་ཏུ་དཀར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called exceptionally white complexion.

source: མཚམས་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called excellent boundary.

source: རང་གི་ས་ན་གནས་ཤིང་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called manifesting and abiding in one’s own place.

source: ཆུའི་དུས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called season of water.

source: ཨུད་པ་ལའི་དྲི་ལྟར་བསུང་ཞིམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called fragrance like theutpala flower.

source: རྗེན་པའི་བཅུད་སྦྱིན་པའི་རྣམ་པར་ཐར་པའི་སྒོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called liberation gateway offering fresh elixir.

source: མི་གཡོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called unwavering.

source: མི་འགུལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called unmoving.

source: ཆུའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called essence of water.

source: རྣམ་པར་དག་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called having pure intelligence.

source: རི་བོ་ཐམས་ཅད་ཀྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called having intelligence of all mountains.

source: སྟོབས་ཀྱི་ནོར་བུའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of the jewel of strength.

source: ངན་སྤོང་དང་ཁ་བ་ཅན་རྣམ་པར་ཐར་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called abandoning evil to bring liberation to the snowy mountains.

source: རླུང་གི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of the magical manifestation of wind.

source: མི་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called nonabiding.

source: ནམ་མཁའ་ལ་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: There is the samādhi called perception of space.

source: སྣང་བའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing an illuminating intellect.

source: ཐོག་ཏོག་གི་དུས་ཚོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called time of the hailstorm.

source: རྒྱལ་པོའི་སྙིང་པོ་དྲ་བ་ཅན་གྱི་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called magical manifestation of the net of the kingly essence.

source: ཡུལ་གྱི་ནད་འཐོར་བར་བྱེད་པའི་ཆོས་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called Dharma lamp that disperses illnesses of the sense objects.

source: ཡུལ་གྱི་སྟོབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called engaging the power of the sense objects.

source: ཆོས་ཀྱི་བཀྲ་ཤིས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called auspiciousness of Dharma.

source: ཆོས་ཀྱི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called strength of Dharma.

source: ཆོས་ཀྱི་སྟོབས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called possessing the strength of Dharma.

source: ལེགས་པའི་དོག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called excellent flower bud.

source: དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called joyous.

source: རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called overjoyed.

source: ཡེ་ཤེས་ཀྱི་སྟོབས་ཆེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called great strength of gnosis.

source: ཀ་ཏ་ཀའི་འབྲས་བུ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called like the kataka fruit.

source: འགྲམ་དུ་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called going to the shore.

source: དཔའ་བར་འགྲོ་བ་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called heroic gate.

source: རྣམ་པར་རྒྱལ་བའི་སྟོབས་ཀྱིས་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called going with increased strength.

source: འོད་འཕྲོ་མཆོག་གི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the supreme intellect that radiates light.

source: སྟོབས་མི་ཟད་པའི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called liberation of inexhaustible strength.

source: འཕགས་པའི་སྟོབས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called exalted strength.

source: ལུས་སྲུང་བ་མི་ཟད་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of inexhaustible armor.

source: ལུས་སྲུང་རྨ་ཤིང་མདོག་གི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of red sandalwood–colored armor.

source: འཁྲི་ཤིང་རྒྱས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called lush vines.

source: སྒྲ་སྙན་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of melodic instruments.

source: འགྲོ་བའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called traveling light.

source: རིན་པོ་ཆེའི་དཔལ་དུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called becoming glorious as precious substances.

source: གཙང་ཞིང་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called pure and stainless.

source: གཙང་མའི་སྙིང་པོ་མདངས་དཀར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called white luster of the essence of purity.

source: གཙང་ཞིང་གཙང་སྦྲའི་རིན་པོ་ཆེའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect of the jewel of purity and cleanliness.

source: དགའ་ཞིང་དང་བར་གྲགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called renowned for joyful faith.

source: སེམས་ནམ་མཁའ་དང་མཉམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called mind equal to space.

source: ཅོད་པན་རྣམ་པར་འཕྱང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: “There is the samādhi called draped diadem.

source: སྟོབས་བླ་ན་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called unsurpassed strength.

source: རྗེས་སུ་སྲུང་བའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect that keeps guard.

source: རྗེས་སུ་ཆགས་པ་ཟབ་མོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called profound desire.

source: སྟོབས་ཟློག་པའི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the intellect that repulses strength.

source: འོད་དལ་གྱིས་གཡོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called softly wavering light.

source: བརྩོན་འགྲུས་ཡིད་དུ་འོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called pleasing vigor.

source: མ་སྐྱེས་པའི་འོད་ཟེར་ལེན་པ་ལ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called taking and abiding in uncreated light rays.

source: དམིགས་པའི་འོད་ཟེར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called king of visualized light rays.

source: དམིགས་པ་གཙང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called pure visualization.

source: རླུང་ལྟར་མགྱོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called wind-like swiftness.

source: དཔལ་གྱི་བློ་གྲོས་ཅན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called endowed with the highest intellect.

source: ཀུན་ཏུ་རླུང་ཆེན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called great universal wind.

source: རྒྱ་མཚོའི་རླབས་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called stainless ocean wave.

source: བདེ་བའི་སྟོབས་ཀྱི་མིག་འཛུམས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: There is the samādhi called closing the eyes of the strength of bliss.
